src/web/intranet/frontend/controllers/AnniversaryController.php

    public function actionDate() {

        $months = array("Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre") ;
        $month  = $months[date('n') - 1] ;
        $year   = date('Y') ;

        $users = \Edvlerblog\Adldap2\model\UserDbLdap::find()->select('username')->all() ;
        $birthday   = [];
        $anniversary   = [];
        foreach ($users as $row) {
            $statususer    = \common\models\User::find()->select('status')->where(['username' => $row->username])->one() ;
---
SELECT `status` FROM `user` WHERE `username`='aalvarado'

    public function actionJsonanniversary() {
        $users = \Edvlerblog\Adldap2\model\UserDbLdap::find()->select('username')->all() ;

        foreach ($users as $row) {
            $statususer    = \common\models\User::find()->select('status')->where(['username' => $row->username])->one() ;
---
SELECT `status` FROM `user` WHERE `username`='aalvarado'

    public function actionJsonbirthday() {
        $user          = \Yii::$app->user->identity->username ;
        $userData      = \Yii::$app->ad->getDefaultProvider()->search()->findBy('sAMAccountname', $user) ;
        $statususer    = \common\models\User::find()->select('status')->where(['username' => $user])->one() ;
---
SELECT `status` FROM `user` WHERE `username`='ylopez'