src/web/intranet/frontend/controllers/LinkController.php

SELECT COUNT(*) FROM `link`
SELECT * FROM `link` LIMIT 3
---
    public function actionSearch() {
        $links = Link::find() ;

        if (Yii::$app->request->isPost) {
            $searchString                    = Yii::$app->request->post('search') ;
            Yii::$app->session['searchlink'] = $searchString ;

            $links = Link::find()->filterWhere(['or',
                ['like', 'link_name', $searchString],
                ['like', 'link_description', $searchString]
            ]) ;

        } else {
            $searchString = Yii::$app->session['searchlink'] ;
        }

        $count = $links->count();
        $pages = new Pagination([
            "pageSize"   => 4,
            "totalCount" => $count
        ]) ;
        $model = $links
                ->offset($pages->offset)
                ->limit($pages->limit)
                ->all() ;