src/web/intranet/frontend/controllers/NewsController.php

    public function actionRss() {
        \Feed::$cacheExpire = '5 hours' ;
        $sources            = News::find()->where(['categoryne_id' => News::CONST_CATEGORY_NEWS_TECNOLOGY ])->all() ;
        $items              = ArrayHelper::map($sources, 'news_id', 'news_channel') ;
        $items['A']         = "Todo";
        $select             = null ;
        if (Yii::$app->request->get('source')) {
            $select = Yii::$app->request->get('source') ;

            if ( $select != "A") {
                $sources = News::find()->where(['news_id' => $select])->andWhere(['categoryne_id' => News::CONST_CATEGORY_NEWS_TECNOLOGY])->all() ;
---
SELECT * FROM `news` WHERE `categoryne_id`=1
SELECT * FROM `news` WHERE (`news_id`='4') AND (`categoryne_id`=1)