src/web/intranet/frontend/controllers/NewsbusinessController.php

SELECT * FROM `news_category`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $itemsData= \common\models\NewsCategory::find()->all();

SELECT * FROM `news_category`
SELECT COUNT(*) FROM (SELECT * FROM `news_business` WHERE `categoryne_id`='2' ORDER BY `nbusiness_date` DESC) `c`
SELECT * FROM `news_business` WHERE `categoryne_id`='3' ORDER BY `nbusiness_date` DESC LIMIT 2
---
    public function actionShow($id)
    {
       $news=NewsBusiness::find()->where(['categoryne_id'=>$id])->orderBy('nbusiness_date DESC');
       $count= clone $news;

       $category= \common\models\NewsCategory::find()->all();
       foreach ($category as $rowc) {
            if ($rowc->categoryne_id ==$id ) {
                $description=$rowc->categoryne_name;
            }
        }

       $pages= new Pagination([
           "pageSize"=> 2,
           "totalCount"=> $count -> count()
       ]);

       $model=$news
               ->offset($pages->offset)
               ->limit($pages->limit)
               ->all();

SELECT * FROM `news_category`
---
     public function actionDetail($id)
    {
       $category= \common\models\NewsCategory::find()->all();