src/web/intranet/frontend/controllers/NewsbusinessController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $itemsData= \common\models\NewsCategory::find()->all();
        $items= \yii\helpers\ArrayHelper::map($itemsData,'categoryne_id','categoryne_name');

//        if ($model->load(Yii::$app->request->post()) && $model->save()) {
        if ($model->load(Yii::$app->request->post())) {

            //get the instance of the uploaded file

            $imageName= $model->nbusiness_title;
            $model ->file=UploadedFile::getInstance($model,'file');
            $model->file->saveAs('uploads/'.$imageName.'.'.$model->file->extension );
---
UPDATE `news_business` SET `categoryne_id`=2, `nbusiness_active`=1 WHERE `nbusiness_id`=1