src/web/intranet/frontend/controllers/SiteController.php

SELECT `id` FROM `user` WHERE `username`='ylopez'
SELECT * FROM `user_profile` WHERE `id`=5
---
    public function actionLogin() {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome() ;
        }

        $model = new LoginForm() ;

        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $username = $model->username ;
            $model1   = \common\models\User::find()->select('id')->where(['username' => $username])->one() ;
            $id       = $model1->id ;

            $user = \common\models\UserProfile::find()->where(['id' => $id])->one() ;